{
    "Contact": {
        "Name": "Hendrik Fick Renaldo Potgieter",
        "Position": {
            "Title": "Graduate Golang Software Developer at Nile.ag",
            "URL": "https://nile.ag/"
        },        
        "Location": "Gauteng, ZA",
        "ImagePos" : "Top",
        "Email" : {
            "Title" : "hfrpotgieterc@gmail.com",
            "Href" : "mailto:hfrpotgieterC@gmail.com?Subject=Job%20Opportunity"
        },
        "Cell" :{
            "Title" : "+27 66 098 0801",
            "Href" : "tel:+27660980801"
        }
    },
    "About": {
        "Title" : "About me",
        "Description" : "I am a self-sufficient, diligent, and imaginative person who also possesses dependability and has learned to approach tasks and situations with responsibility and ethics. I have great teamwork and communication skills. I firmly believe in moral principles and integrity, and that a person should aim for success in both their personal and professional lives. I also think that if you work hard and have a positive outlook on everything you do, you can succeed in whatever you put your energy into."
    },
    "Career": {
        "Title" : "Career",
        "Description" : "In my field of study, I'm seeking for opportunities to develop and learn. I'm willing and excited to pick up new skills because I know I still have a lot to learn. I enjoy finding creative, effective solutions to challenging issues. I challenge myself to solve problems when they arise, and I won't be content until they are resolved. I am a very determined person who works very hard and is disciplined. To be appointed to this role, I possess the necessary knowledge, communication, and teamwork abilities."
    },
    "Social" :{
        "Title" : "Social",
        "Github" : {
            "Title": "Github",
            "URL" : "https://github.com/henro47"
        },
        "LinkedIn" : {
            "Title": "LinkedIn",
            "URL" : "https://www.linkedin.com/in/hendrikPotgieter4701"
        }
    },
    "Timeline": {
        "Title": "My life thus far",
        "Dates": [
            {
                "Date" : "2017",
                "Title" : "Matriculated",
                "Description" : "Matriculated from Sentraal high school, 37 General Conroy St, Dan Pienaar, Bloemfontein, 9301, ZA."
            },
            {
                "Date" : "2018-2020",
                "Title" : "Bachelor of Science in Information Technology",
                "Description" : "Graduated from the North-West University (NWU), with distinction."
            },
            {
                "Date": "2021",
                "Title" : "Bachelor of Science Honours in Computer Science and Information Technology",
                "Description" : "Graduated from the North-West University (NWU), with distinction."
            },
            {
                "Date":"2022-2023",
                "Title": "Solution Developer at Linxas",
                "Description" : "I began working as a solution developer full-time at Linxas, where I was able to acquire experience with a wide range of programming languages and frameworks. These programming languages and frameworks consist of C#, Ionic Angular, Java, JavaScript, TypeScript, and GuiXT. One of our clients uses a Fullstack Web Application built in Ionic Angular to pull global reports for their company, which is a high point of my position thus far. This solution is comprised of a front-end web application written in Ionic using Angular and a Node.js Express REST API to pull data from a MySQL database hosted on a cloud server."
            },
            {
                "Date": "2022-2023",
                "Title": "Subcontracted Software Developer at Pick n Pay",
                "Description": "Began working as a JavaScript developer and Neptune-Software developer at Pick n Pay. Developing AJAX calls that extract data directly from SAP systems is a crucial responsibility of mine. Additionally, I create native JavaScript functions that connect with other native libraries and SAP functions."
            },
            {
                "Date":"2023-Present",
                "Title": "Graduate software developer at Nile.ag",
                "Description": "Began working as a full-time graduate Golang backend software developer. I set up and maintain microservices that interact using GRPC as part of my crucial position. generating mutations and queries in graphQL schema and retrieving data from our hosted database in GCP. This also includes setting up and maintaining docker configurations."
            }
        ]
    },
    "Projects" : {
        "Honnours" : {
            "Title" : "Projects",
            "Subtitle" : "Automated terrain classification using vibrations and a feed-forward neural network.",
            "Abstract" : "Abstract",
            "Description" : "Automated terrain classification can be described as the ability to identify different terrains based on feedback from the environment on a specific object using a technique such as deep learning. Automated terrain classification using vibration readings has a number of practical applications for society. One of these applications is autonomous self-driving vehicles. With the growing popularity of these vehicles, the ability to classify the terrain the vehicle is currently traversing hold several key benefits for these vehicles. The primary benefit being the fact that these vehicles could traverse various terrains more effectively by adjusting torque settings to accommodate each terrain. Automated terrain classification can be achieved in a number of ways. This study intends to classify terrains using a feed-forward neural network model built in the Keras Application Programming Interface (API) using vibration readings. This study found that a feed-forward neural network can be constructed in the Keras API to accurately classify six different terrains namely bricks, dirt, epoxy, grass, stone and tarmac using vibration readings.",
            "Keywords" : "Keywords: Autonomous vehicles, deep learning, feed-forward neural networks, Keras API, terrain classification, vibrations"
        }
    }
}
